"""
The task:
Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,… Количество элементов (n) вводится с клавиатуры.
"""

n = int(input('Введите число: '))

member = 1
s = member

for i in range(1, n):
    member /= 2 * -1**i
    s += member
print(s)
